/******************************************************************************
 *  Company    : HALCON
 *  Filename   : <UBLOX.c>
 *
 *  Description:
 *  ------------
 *  UBLOX module.
 *
 *  Function(s):
 *  ------------
 *  - UBLOX_Init                          : Initializes the UBLOX GNSS module and sets up interfaces.
 *  - UBLOX_EnableSystems                 : Enables specified GNSS systems (e.g., GPS, GLONASS).
 *  - UBLOX_DisableSystems                : Disables specified GNSS systems.
 *  - UBLOX_CalculateChecksum             : Calculates UBX protocol message checksum.
 *  - UBLOX_HandleRxPacket                : Processes a received UBX message packet.
 *  - UBLOX_Service                       : Periodic service routine for handling incoming UBLOX data.
 *  - UBLOX_PPS_EventHandler              : Handles the Pulse-Per-Second (PPS) signal event.
 *  - UBLOX_FilterNAV_SAT_Satellites      : Filters satellite data from NAV-SAT messages.
 *  - UBLOX_FilterRXM_RaxXSatellites      : Filters satellite data from RXM-RAWX messages.
 *  - UBLOX_UpdateRMX_RAWX_Tel            : Updates telemetry from RXM-RAWX messages.
 *  - UBLOX_UpdateNAV_TimeGPS_Tel         : Updates telemetry from NAV-TIMEGPS message.
 *  - UBLOX_UpdateNAV_TimeGLO_Tel         : Updates telemetry from NAV-TIMEGLO message.
 *  - UBLOX_UpdateNAV_SOL_Tel             : Updates telemetry from NAV-SOL message.
 *  - UBLOX_UpdateNavSatTel               : Updates telemetry from NAV-SAT satellite data.

 *  - UBLOX_ResetConfig                   : Resets the UBLOX module to default configuration.
 *  - UBLOX_SaveConfiguration             : Saves current configuration to non-volatile memory.
 *  - UBLOX_Configure                     : Applies a full configuration to the UBLOX module.
 *  - UBLOX_ConfigureReceiver             : High-level configuration routine for receiver settings.
 *  ...
 *
 *
 ******************************************************************************/

#include <math.h>
#include <string.h>
#include <signal.h>
#include <stdlib.h>
#include <stdio.h>
#include <stdint.h>
#include <stdarg.h>
#include "TypeDefines.h"
#include "FPGA.h"
#include "UART.h"
#include "FIFO.h"
#include "WIAC82_Comms.h"
#include "Interrupts.h"
#include "Weapon.h"
#include "MCP.h"
#include "TaskManager.h"
#include "UBLOX.h"


// Refer to "u-blox 8 / u-blox M8 Receiver Description, UBX-13003221 - R16"

#define UBLOX_MAX_PAYLOAD_LENGTH      2048

#define UBLOX_SYNC_1                  0xB5
#define UBLOX_SYNC_2                  0x62

#define UBLOX_GPS_GNSS_ID             0x00
#define UBLOX_GLO_GNSS_ID             0x06

// UBLOX classes
#define UBLOX_CLASS_NAV               0x01
#define UBLOX_CLASS_RXM               0x02
#define UBLOX_CLASS_INF               0x04
#define UBLOX_CLASS_ACK               0x05
#define UBLOX_CLASS_CFG               0x06
#define UBLOX_CLASS_UPD               0x09
#define UBLOX_CLASS_MON               0x0A
#define UBLOX_CLASS_AID               0x0B
#define UBLOX_CLASS_TIM               0x0D
#define UBLOX_CLASS_ESF               0x10
#define UBLOX_CLASS_MGA               0x13
#define UBLOX_CLASS_LOG               0x21
#define UBLOX_CLASS_SEC               0x27
#define UBLOX_CLASS_HNR               0x28

// UBLOX NAV class id's used
#define UBLOX_NAV_POSECEF_ID          0x01
#define UBLOX_NAV_POSLLH_ID           0x02
#define UBLOX_NAV_DOP_ID              0x04
#define UBLOX_NAV_SOL                 0x06
#define UBLOX_NAV_VELECEF_ID          0x11
#define UBLOX_NAV_TIME_GPS_ID         0x20
#define UBLOX_NAV_TIME_GLO_ID         0x23
#define UBLOX_NAV_SAT_ID              0x35

// UBLOX RMX class id's used
#define UBLOX_RXM_SFRBX_ID            0x13
#define UBLOX_RXM_RAWX_ID             0x15

// UBLOX ACK class id's used
#define UBLOX_ACK_NACK_ID             0x00
#define UBLOX_ACK_ACK_ID              0x01

// UBLOX CFG class id's used
#define UBLOX_CFG_PRT_ID              0x00
#define UBLOX_CFG_MSG_ID              0x01
#define UBLOX_CFG_RATE_ID             0x08
#define UBLOX_CFG_CFG_ID              0x09
#define UBLOX_CFG_NAV5_ID             0x24
#define UBLOX_CFG_GNSS_ID             0x3E

// UBLOX MON class id's used
#define UBLOX_MON_VER_ID              0x04

// UBLOX TIM class id's used
#define UBLOX_TIM_TP_ID               0x01


typedef enum {
  ubloxGET_SYNC_1,
  ubloxGET_SYNC_2,
  ubloxGET_HEADER,
  ubloxGET_PAYLOAD
} eUBLOX_State;

typedef enum {
  ublox_ackWAITING,
  ublox_ackNACK,
  ublox_ackACK
} eUBLOX_ACK_State;


#pragma pack(1)

typedef struct
{
  unsigned char Class;
  unsigned char Id;
  unsigned short PayloadLength;
} sUBLOX_Header;

typedef struct
{
  sUBLOX_Header Header;
  unsigned char Data[UBLOX_MAX_PAYLOAD_LENGTH];
} sUBLOX_Packet;

typedef union
{
  unsigned int DWord;
  struct {
    unsigned int Reserved1    : 6;
    unsigned int CharLength   : 2;
    unsigned int Reserved2    : 1;
    unsigned int Parity       : 3;
    unsigned int StopBits     : 2;
    unsigned int Reserved3    : 18;
  } Bits;
} uUBLOX_PortMode;

typedef struct
{
  unsigned char   PortID;
  unsigned char   Reserved1;
  unsigned short  TxReady;
  uUBLOX_PortMode Mode;
  unsigned int    Baudrate;
  unsigned short  InProtoMask;
  unsigned short  OutProtoMask;
  unsigned short  Flags;
  unsigned short  Reserved2;
} sUBLOX_PortSettings;

typedef struct
{
  unsigned int ClearMask;
  unsigned int SaveMask;
  unsigned int LoadMask;
  unsigned char DeviceMask;
} sUBLOX_Config;

typedef struct
{
  unsigned short ApplySettingMask;        // 0
  unsigned char DynPlatformModal;         // 2
  unsigned char PosFixingMode;            // 3
  int FixedAltitude;                      // 4
  unsigned int FixedAltVar;               // 8
  signed char MinSatElev;                 // 12
  unsigned char Reserved1;                // 13
  unsigned short PDOP_Mask;               // 14
  unsigned short TDOP_Mask;               // 16
  unsigned short PosAccMask;              // 18
  unsigned short TimeAccMask;             // 20
  unsigned char StaticHoldThresh;         // 22
  unsigned char DGNSS_Timeout;            // 23
  unsigned char CNO_ThreshNumSV;          // 24
  unsigned char CNO_Thresh;               // 25
  unsigned char Reserved2;                // 26
  unsigned char Reserved3;                // 27
  unsigned short StaticHoldMaxDist;       // 28
  unsigned char UTC_Standard;             // 30
  unsigned char Reserved4;                // 31
  unsigned char Reserved5;                // 32
  unsigned char Reserved6;                // 33
  unsigned char Reserved7;                // 34
  unsigned char Reserved8;                // 35
} sUBLOX_NAV_Settings;

#pragma pack()


volatile sUBLOX UBLOX;
volatile sUBLOX_GNSS_20HzBlock1 UBLOX_GNSS_20HzBlock1;
volatile sUBLOX_GNSS_20HzBlock2 UBLOX_GNSS_20HzBlock2;
volatile sUBLOX_GNSS_20HzBlock3 UBLOX_GNSS_20HzBlock3;

static volatile eUBLOX_ACK_State UBLOX_ACK_State;
static unsigned char RxData[1024];
static volatile TIME UBLOX_PPS_Timestamp;
static volatile unsigned int UBLOX_Index;
static volatile unsigned int UBLOX_PacketLength;
static volatile sUBLOX_Packet UBLOX_RxPacket;
static volatile eUBLOX_State UBLOX_State;
static volatile sUART UBLOX_UART;
static volatile T_GNSS_Setup GNSS_Setup;
static T_UBX_NAV_SAT UBLOX_NAV_SAT;
static T_UBX_RXM_RAWX UBLOX_RXM_RAW_X;
static unsigned char UBLOX_RMX_SFRBX_GPS_SV_Index;
static unsigned char UBLOX_RMX_SFRBX_GLO_SV_Index;
static unsigned int UBLOX_RMX_SFRBX_GPS_SV_Timestamp;
static unsigned int UBLOX_RMX_SFRBX_GLO_SV_Timestamp;
static unsigned int UBLOX_RMX_SFRBX_PacketCnt;

